app/Controllers/Categorias.php

    public function index($activo = 1)
    {
        $categorias = $this->categorias->where('activo', $activo)->findAll();
---
SELECT *
FROM `categorias`
WHERE `activo` = 1

    public function eliminados($activo = 0)
    {
        $categorias = $this->categorias->where('activo', $activo)->findAll();
---
SELECT *
FROM `categorias`
WHERE `activo` = 0

    public function insertar()
    {
        $this->categorias->save([
            'nombre' => $this->request->getPost('nombre')
        ]);
---
INSERT INTO `categorias` (`nombre`, `created_at`, `updated_at`) VALUES ('Pan dulce', '2023-02-13 21:56:25', '2023-02-13 21:56:25')

    public function editar($id)
    {
        $unidad = $this->categorias->where('id', $id)->first();
---
SELECT *
FROM `categorias`
WHERE `id` = '4'
 LIMIT 1

    public function actualizar()
    {
        $this->categorias->update(
            $this->request->getPost('id'),
            [
                'nombre' => $this->request->getPost('nombre')            ]
        );
---
UPDATE `categorias` SET `nombre` = 'Pan dulcee', `updated_at` = '2023-02-13 21:56:56'
WHERE `categorias`.`id` IN ('4')

    public function eliminar($id)
    {
        $this->categorias->update(
            $id,
            [
                'activo' => 0
            ]
        );
---
UPDATE `categorias` SET `activo` = 0, `updated_at` = '2023-02-13 21:56:59'
WHERE `categorias`.`id` IN ('4')

    public function reingresar($id)
    {
        $this->categorias->update(
            $id,
            [
                'activo' => 1
            ]
        );
---
UPDATE `categorias` SET `activo` = 1, `updated_at` = '2023-02-13 21:57:05'
WHERE `categorias`.`id` IN ('4')