app/Controllers/Unidades.php

    public function index($activo = 1)
    {
        $unidades = $this->unidades->where('activo', $activo)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 1

    public function eliminados($activo = 0)
    {
        $unidades = $this->unidades->where('activo', $activo)->findAll();
---
SELECT *
FROM `unidades`
WHERE `activo` = 0

    public function insertar()
    {
        $this->unidades->save([
            'nombre' => $this->request->getPost('nombre'),
            'nombre_corto' => $this->request->getPost('nombre_corto')
        ]);
---
INSERT INTO `unidades` (`nombre`, `nombre_corto`, `created_at`, `updated_at`) VALUES ('Kilogramo', 'Kg5', '2023-02-13 10:29:10', '2023-02-13 10:29:10')

    public function editar($id)
    {
        $unidad = $this->unidades->where('id', $id)->first();
---
SELECT *
FROM `unidades`
WHERE `id` = '4'
 LIMIT 1

    public function eliminar($id)
    {
        $this->unidades->update(
            $id,
            [
                'activo' => 0
            ]
        );
---
UPDATE `unidades` SET `activo` = 0, `updated_at` = '2023-02-13 10:55:38'
WHERE `unidades`.`id` IN ('4')

    public function reingresar($id)
    {
        $this->unidades->update(
            $id,
            [
                'activo' => 1
            ]
        );
---
UPDATE `unidades` SET `activo` = 1, `updated_at` = '2023-02-13 10:55:20'
WHERE `unidades`.`id` IN ('3')